frontend/artillery-load-test.yml
config:
  target: "http://127.0.0.1:3000"
  tls:
    rejectUnauthorized: false
  http:
    timeout: 10
  phases:
    - duration: 30
      arrivalRate: 2
      maxVusers: 50
      name: Warm up phase
    - duration: 30
      arrivalRate: 28
      maxVusers: 250
      name: Ramp up load
    - duration: 30
      arrivalRate: 56
      maxVusers: 1000
      name: Spike phase
  environments:
    local:
      target: http://localhost:3000
      phases:
        - duration: 2
          arrivalRate: 5
          name: Warm up phase
        - duration: 1
          arrivalRate: 1
          maxVusers: 1
          name: Ramp up load
        - duration: 1
          arrivalRate: 1
          maxVusers: 1
          name: Spike phase          
    prod:
      target: https://simpler.grants.gov
    staging:
      target: http://frontend-staging-1506108424.us-east-1.elb.amazonaws.com
    dev:
      target: http://frontend-dev-1739892538.us-east-1.elb.amazonaws.com
  plugins:
    expect:
      outputFormat: prettyError
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  processor: "./tests/artillery/processor.ts"

before:
  flow:
    - function: loadData

scenarios:
  - name: Opportunity Pages
    beforeScenario: getOppId
    flow:
      - get:
          url: "/opportunity/{{ id }}"
      - log: "GET /opportunity/{{ id }}"
  - name: 404 Pages
    beforeScenario: get404
    flow:
      - get:
          url: "/{{ route }}"
      - log: "GET /{{ route }}"
  - name: Searches
    beforeScenario: getSearchQuery
    flow:
      - get:
          url: "/search?{{ query }}"
      - log: "GET /search?{{ query }}"