frontend/artillery-load-test.yml
config:
  tls:
    rejectUnauthorized: false
  http:
    timeout: 10
  phases:
    - duration: 30
      arrivalRate: 2
      maxVusers: 50
      name: Warm up phase
    - duration: 30
      arrivalRate: 28
      maxVusers: 250
      name: Ramp up load
    - duration: 30
      arrivalRate: 56
      maxVusers: 1000
      name: Spike phase
  environments:
    local:
      target: http://localhost:3000
      phases:
        - arrivalCount: 10
          duration: 30
    prod:
      target: https://simpler.grants.gov
    staging:
      target: http://frontend-staging-1506108424.us-east-1.elb.amazonaws.com
    dev:
      target: http://frontend-dev-1739892538.us-east-1.elb.amazonaws.com
  plugins:
    expect:
      outputFormat: prettyError
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  payload:
    - path: "tests/artillery/{{ $environment}}-opportunities.csv"
      fields:
        - opp_id
      skipHeader: true
      name: opps
    - path: "tests/artillery/{{ $environment}}-search.csv"
      fields:
        - query
        - page
        - status
        - agency
      skipHeader: true
      name: opps
scenarios:
  - name: opportunities
    flow:
      - loop:
          - get:
              url: "/opportunity/{{ opp_id }}"
          - think: 1
        count: 10
        over: opps
        log: "/opportunity/{{ opp_id }}"
  - name: search
    flow:
      - loop:
          - get:
              url: "/search?query={{ query }}&page={{ page }}&status={{ status }}"
          - think: 1
        count: 10
        over: opps
        log: "/opportunity/{{ opp_id }}"